<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,2048,2" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>-1</dim>
					<dim>2048</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="const_fold_opt__646" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__646">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="ComplexWaveNet_1/lambda_1/conv1d_1/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2048</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/lambda_1/conv1d_1/ExpandDims:0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_70" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="ComplexWaveNet_1/lambda_1/conv1d_1__10" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/lambda_1/conv1d_1__10:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="ComplexWaveNet_1/conv1d_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 2, 1, 1" offset="40" size="512" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ComplexWaveNet_1/conv1d_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="ComplexWaveNet_1/conv1d_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_1/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="axes_const__119__352" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="552" size="8" />
			<output>
				<port id="0" precision="I64" names="axes_const__119__352">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ComplexWaveNet_1/conv1d_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="const_fold_opt__715_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="560" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__715">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="const_fold_opt__715" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="ComplexWaveNet_1/conv1d_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_303" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="816" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_304" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="840" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_302_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="864" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="16" name="Constant_302" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="17" name="ComplexWaveNet_1/conv1d_1_2/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="ComplexWaveNet_1/conv1d_1_2/Pad:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2050</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ComplexWaveNet_1/conv1d_1_2/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2050</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_1_2/convolution/ExpandDims:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2050</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="ComplexWaveNet_1/conv1d_1_2/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 3" offset="866" size="98304" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_1_2/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ComplexWaveNet_1/conv1d_1_2/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ComplexWaveNet_1/conv1d_1_2/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2050</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_1_2/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="ComplexWaveNet_1/conv1d_1_2/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_1_2/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="const_fold_opt__717_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="99170" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__717">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="const_fold_opt__717" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="ComplexWaveNet_1/conv1d_1_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_1_2/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="ComplexWaveNet_1/conv1d_1_2/Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ComplexWaveNet_1/conv1d_1_2/Tanh:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="ComplexWaveNet_1/conv1d_2_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 3" offset="99426" size="98304" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_2_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ComplexWaveNet_1/conv1d_2_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ComplexWaveNet_1/conv1d_2_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2050</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_2_1/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="ComplexWaveNet_1/conv1d_2_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_2_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="const_fold_opt__710_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="197730" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__710">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="const_fold_opt__710" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="ComplexWaveNet_1/conv1d_2_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_2_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="ComplexWaveNet_1/conv1d_2_1/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ComplexWaveNet_1/conv1d_2_1/Sigmoid:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="ComplexWaveNet_1/multiply_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/multiply_1/Mul:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="ComplexWaveNet_1/conv1d_4_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_4_1/convolution/ExpandDims:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="ComplexWaveNet_1/conv1d_4_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 1, 1" offset="197986" size="65536" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_4_1/convolution/ExpandDims_1:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="ComplexWaveNet_1/conv1d_4_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="ComplexWaveNet_1/conv1d_4_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_4_1/convolution:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ComplexWaveNet_1/conv1d_4_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_4_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="const_fold_opt__709_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="263522" size="512" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__709">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="const_fold_opt__709" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="ComplexWaveNet_1/conv1d_4_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_4_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="ComplexWaveNet_1/conv1d_3_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 1" offset="264034" size="32768" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_3_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="ComplexWaveNet_1/conv1d_3_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="ComplexWaveNet_1/conv1d_3_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_3_1/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="ComplexWaveNet_1/conv1d_3_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_3_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="const_fold_opt__671_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="296802" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__671">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="const_fold_opt__671" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="ComplexWaveNet_1/conv1d_3_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_3_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="ComplexWaveNet_1/add_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/add_1/Add:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_329" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="297058" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_330" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="840" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_328_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="864" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="55" name="Constant_328" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="56" name="ComplexWaveNet_1/conv1d_5_1/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="ComplexWaveNet_1/conv1d_5_1/Pad:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2052</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="ComplexWaveNet_1/conv1d_5_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2052</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_5_1/convolution/ExpandDims:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2052</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="ComplexWaveNet_1/conv1d_5_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 3" offset="297082" size="98304" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_5_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="ComplexWaveNet_1/conv1d_5_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="ComplexWaveNet_1/conv1d_5_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 2" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2052</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_5_1/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="ComplexWaveNet_1/conv1d_5_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_5_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="const_fold_opt__674_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="395386" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__674">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="const_fold_opt__674" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="ComplexWaveNet_1/conv1d_5_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_5_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="ComplexWaveNet_1/conv1d_5_1/Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ComplexWaveNet_1/conv1d_5_1/Tanh:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="ComplexWaveNet_1/conv1d_6_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 3" offset="395642" size="98304" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_6_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="ComplexWaveNet_1/conv1d_6_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="ComplexWaveNet_1/conv1d_6_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 2" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2052</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_6_1/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="ComplexWaveNet_1/conv1d_6_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_6_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="const_fold_opt__711_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="493946" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__711">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="const_fold_opt__711" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="ComplexWaveNet_1/conv1d_6_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_6_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="ComplexWaveNet_1/conv1d_6_1/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ComplexWaveNet_1/conv1d_6_1/Sigmoid:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="ComplexWaveNet_1/multiply_1_2/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/multiply_1_2/Mul:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="ComplexWaveNet_1/conv1d_7_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_7_1/convolution/ExpandDims:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="ComplexWaveNet_1/conv1d_8_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 1, 1" offset="494202" size="65536" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_8_1/convolution/ExpandDims_1:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="ComplexWaveNet_1/conv1d_8_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="ComplexWaveNet_1/conv1d_8_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_8_1/convolution:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="ComplexWaveNet_1/conv1d_8_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_8_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="const_fold_opt__675_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="559738" size="512" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__675">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="const_fold_opt__675" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ComplexWaveNet_1/conv1d_8_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_8_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="ComplexWaveNet_1/add_5_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/add_5_1/Add:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="ComplexWaveNet_1/conv1d_7_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 1" offset="560250" size="32768" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_7_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="ComplexWaveNet_1/conv1d_7_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="ComplexWaveNet_1/conv1d_7_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_7_1/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="ComplexWaveNet_1/conv1d_7_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_7_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="const_fold_opt__677_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="593018" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__677">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="const_fold_opt__677" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="ComplexWaveNet_1/conv1d_7_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_7_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="ComplexWaveNet_1/add_1_2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/add_1_2/Add:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_356" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="593274" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_357" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="840" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_355_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="864" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="95" name="Constant_355" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="96" name="ComplexWaveNet_1/conv1d_9_1/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="ComplexWaveNet_1/conv1d_9_1/Pad:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2056</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="ComplexWaveNet_1/conv1d_9_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2056</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_9_1/convolution/ExpandDims:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2056</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="ComplexWaveNet_1/conv1d_9_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 1, 3" offset="593298" size="98304" />
			<output>
				<port id="0" precision="FP16" names="ComplexWaveNet_1/conv1d_9_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="ComplexWaveNet_1/conv1d_9_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="ComplexWaveNet_1/conv1d_9_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 4" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2056</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_9_1/convolution:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="ComplexWaveNet_1/conv1d_9_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexWaveNet_1/conv1d_9_1/convolution/Squeeze:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="const_fold_opt__678_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1" offset="691602" size="256" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__678">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="const_fold_opt__678" type="Convert" version="opset1">
